app/Controllers/Registros.php

                "llave_secreta"=>str_replace('$','o',$llave_secreta)
            );
            $model = new RegistrosModel();
            $registro = $model->insert($datos);
---
INSERT INTO `registros` (`nombres`, `apellidos`, `email`, `cliente_id`, `llave_secreta`) VALUES ('Juan', 'Albarrán Romero', 'juan.albarran@upeu.edu.pe', 'a2aa07adfhdfrexfhgdfhdferttge1AfCiPpOe3BQmpzFnJuFfhxdTS.AueC', 'o2ao07odfhdfrexfhgdfhdferttge/d8i4pnkf4NHE1NpqrUCHbYT9v77NKW')